<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
! tailscale_tailnet_key.key is tainted, so must be replaced
+ time_rotating.rotate_tailnet_key will be created
~ module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
! module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.tailscale_butane.terraform_data.butane_snippet_stable[0] is tainted, so must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-14T05:51:09Z [(view log)](https://github.com/perchnet/p/actions/runs/16259070169/job/45900526607#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # tailscale_tailnet_key.key is tainted, so must be replaced
-/+ resource "tailscale_tailnet_key" "key" {
      ~ created_at    = "2025-07-14T02:33:59Z" -> (known after apply)
      ~ expires_at    = "2025-07-14T03:33:59Z" -> (known after apply)
      ~ id            = "kdssZqv96721CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
      ~ reusable      = false -> true
        tags          = [
            "tag:periphery",
        ]
      + user_id       = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = (sensitive value)
      + strict       = true
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "359cbc80.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/359cbc80.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "359cbc80.butane-ci-user-data.ign" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.65",
            ],
          - [],
          - [
              - "172.17.0.1",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2600:4808:6170:3a00::350c",
              - "fdfd:3a:a7ff:0:eccc:ce6b:d3ba:5163",
              - "2600:4808:6170:3a00:82ad:7e25:b419:4c05",
              - "fe80::9594:eae2:6391:6bab",
            ],
          - [
              - "fe80::15ba:ea81:d096:a87c",
            ],
          - [],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:2F:68:F5",
          - "00:00:00:00:00:00",
          - "06:87:FA:EC:9D:84",
        ] -> (known after apply)
        name                    = "tf-coreos-periphery-I3k"
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
          - "docker0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/359cbc80.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:2F:68:F5" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.tailscale_butane.terraform_data.butane_snippet_stable[0] is tainted, so must be replaced
-/+ resource "terraform_data" "butane_snippet_stable" {
      ~ id     = "c9341454-0a84-5abe-a3aa-ff0b5949fdb5" -> (known after apply)
      ~ input  = (sensitive value)
      ~ output = <<-EOT
            variant: fcos
            version: 1.5.0
            systemd:
              units:
                - name: tailscale-up.service
                  enabled: true
                  contents: |
                    [Unit]
                    Description=Connect to Tailscale
                    After=network-online.target tailscaled.service
                    Wants=network-online.target
                    Requires=tailscaled.service
            
                    [Service]
                    Type=oneshot
                    RemainAfterExit=yes
                    ExecStart=/usr/bin/tailscale up --authkey=tskey-auth-kdssZqv96721CNTRL-wLTknRUZiZWsNUA1xmjmVWEYv4HNzPsqU --advertise-tags=tag:periphery 
                    ExecStartPost=/bin/sh -c 'echo "Tailscale connected successfully" | systemd-cat -t tailscale-up'
                    
                    StandardOutput=journal+console
                    StandardError=journal+console
            
                    [Install]
                    WantedBy=multi-user.target
        EOT -> (known after apply)
    }

Plan: 5 to add, 0 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-36-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->